taskt/Core/Automation/Commands/JSONGroup/ICanHandleJSONArray.dot
digraph "taskt.Core.Automation.Commands.ICanHandleJSONArray" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.ICanHandleJSONArray" [ label="ICanHandleJSONArray", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.ICanHandleJSON" [ label="ICanHandleJSON", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExpandableProperties" [ label="IExpandableProperties", shape="ellipse", style="dashed", ];

"taskt.Core.Automation.Commands.ICanHandleJSONArray" -> "taskt.Core.Automation.Commands.ICanHandleJSON";
"taskt.Core.Automation.Commands.ICanHandleJSON" -> "taskt.Core.Automation.Commands.IExpandableProperties";
}
