taskt/Core/Automation/Commands/JSONGroup/ICanHandleJSONArray.puml
@startuml
package "taskt.Core.Automation.Commands"{
Interface "ICanHandleJSONArray" {
}
}

package "taskt.Core.Automation.Commands"{
Interface "ICanHandleJSON" {
}
}

package "taskt.Core.Automation.Commands"{
Interface "IExpandableProperties" {
}
}


taskt.Core.Automation.Commands.ICanHandleJSON <|-- taskt.Core.Automation.Commands.ICanHandleJSONArray
taskt.Core.Automation.Commands.IExpandableProperties <|-- taskt.Core.Automation.Commands.ICanHandleJSON
@enduml
